package database;

public class DB_Info2 {
/*관계 데이터 모델 : 관계형 데이터베이스 = 표 형태
- 릴레이션 = 테이블 
- 행 = row = 튜플 = 레코드
- 열 = attribute = 속성 = 필드
- 도메인 = 속성들이 가질 수 있는 값들의 집합 , 데이터타입(Data Type)과 길이를 의미한다.

- 릴레이션 스키마(필드명) : 모든 속성의 이름으로 정의 , 
- 릴레이션 인스턴스 : 튜플들의 집합

키 : 튜플들을 유일하게 구별하는 속성 또는 속성들의 집합
- 기본키(primary key = PK) : 유일성(UNIQUE)과 최소성(NOTNULL)을 만족하는 속성
					ex)주민번호 , 은행 , 계좌번호
					테이블의 각 행을 고유하게 식별할 수 있는 속성 (열)

컬럼(column) = 열
- 외래키 (foreign key = FK) : 두 테이블의 데이터 간 연결을 설정하고 강제 적용하여 외래 키 테이블에 
					저장 될 수 있는 데이터를 제어하는데 사용되는 속성(열)
					어느 테이블에서는 기본키 이지만 다른 테이블에서는 하나의 컬럼으로만 존재하는 컬럼을 지칭한다. 

무결성 제약조건 : 데이터의 무결성(정확성)을 보장하고 일관된 상태로 유지하기 위한 규칙
무결성 : 데이터에 결함이 없는 상태 , 즉 데이터가 정확하게 유호하게 유지된 상태
 - 개체 무결성 제약 조건 : 기본키를 가진 속성(열)은 null값을 가질 수 없다.(NOTNULL)
 -참조 무결성 제약 조건 : 외래키는 참조할 수 없는 값을 가질수 없다.

	
 * 
 */
}
